app/controllers/flipfloppers_controller.rb

  def index
    @flipfloppers = Flipflopper.all
---
SELECT "flipfloppers".* FROM "flipfloppers"

  def create
    @flipflopper = Flipflopper.new(flipflopper_params)

    respond_to do |format|
      if @flipflopper.save
---
INSERT INTO "flipfloppers" ("birthday", "comment", "created_at", "drink", "email", "name", "surname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @flipflopper.destroy
---
DELETE FROM "flipfloppers" WHERE "flipfloppers"."id" = ?  [["id", 1]]

    def set_flipflopper
      @flipflopper = Flipflopper.find(params[:id])
---
SELECT "flipfloppers".* FROM "flipfloppers" WHERE "flipfloppers"."id" = ? LIMIT 1  [["id", "1"]]